Re_6M/0deg_2KC_SF/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.2e-05;  //Para Prt0 = 0.9, empleando nut = 1.09e-05

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform 1.2e-05;
    }

    outlet
    {
        type            freestream;
        freestreamValue uniform 1.2e-05;
    }

    airfoil
    {
        type            fixedValue;
        value           uniform 0;
    }

    defaultPatches
    {
        type            empty;
    }
}

// ************************************************************************* //
